import { printGreeting } from './texts'

// напечатать приветствие
printGreeting()

// спросить стартовый баланс
let balance = inputStartBalance()

do {
  // спросить цвет ставки (ч/к)
  // спросить размер ставки
  // сгенерировать случайный цвет (ч 30% / к 30% / з 40% )
  // сообщить результат
  // если цвета совпадают - увеличить баланс на ставку
  // если цвета не совпадают - списать баланс ставки
} while (true) // продолжать, пока есть деньги и игрок хочет продолжить

// напечатать завершающий текст
  // если нет денег то вышварнуть из казино))
  // если выиграл, попросить не возвращаться
  // если проиграл, но не всё, предложить поскорее возвращаться
