export {}
// ЦИКЛЫ

/*
while (*условие*) {
}

do {
} while (*условие*)

for (*объявление счётчика*; *условие*; *изменение счётчика*) {
}
*/



// WHILE - повторять, пока условие верно

// while (true) {
//   // бесконечный цикл
// }

while (false) {
  // 0 повторений цикла
}


let n: number

n = 1
while (n === 1) {
  n++ // 1 повторение цикла
}

console.log('n', n) // 2


n = 1
while (n === 2) {
  n++ // 0 повторений цикла
}

console.log('n', n) // 1



// DO / WHILE - выполнить, затем повторять, пока условие верно

// do {
//   // бесконечный цикл   
// } while (true)

do {
  // 1 повторение цикла
} while (false)


n = 1
do {
  n++ // 1 повторение цикла
} while (n === 1)

console.log('n', n) // 2


n = 1
do {
  n++ // 2 повторения цикла
} while (n === 2)

console.log('n', n) // 3



// FOR - повторять заданное количество раз

// for ( ; ; ) {
//   // бесконечный цикл
// }

// for ( ; true; ) {
//   // бесконечный цикл
// }

for (; false;) {
  // 0 повторений цикла
}


n = 1
for (let i = 1; i <= 10; i++) {
  n += 1 // 10 повторений цикла
}

console.log('n', n) // 11


n = 1
let i = 0
for (; i < 10;) {
  n++ // 10 повторений цикла
  i++
}

console.log('i', i)
console.log('n', n) // 11


n = 1
for (let i = 10; i > 0; i--) {
  n += 1 // 10 повторений цикла
}

console.log('n', n) // 11


// УПРАВЛЕНИЕ ЦИКЛОМ (лучше не использовать)

// break (прервать цикл)
// continue (пропустить тело цикла и перейти к следующей итерации)

for (let i = 1; i < 1000000; i++) {
  if (i === 10) {
    break
  }
}

label: for (let i = 1; i < 1000000; i++) {
  if (i < 10) {
    continue
  }
  break label
}

// ВЛОЖЕННЫЕ ЦИКЛЫ

for (let i = 1; i <= 3; i++) {
  for (let j = 1; j <= 3; j++) {
    print(`${i} * ${j} = ${i * j}`)
  }
}
