export{}

/*
Задача
Ввести цифру, обозначающую высоту треугольника.
Напечатать прямоугольный треугольник,
у которого высота и ширина равны,
и который заполняется последовательностями цифр от 1, 
где каждая следующая цифра на 1 больше предыдущей по обеим осям:

1
23
345
4567

*/

const size = Number(input('size = '))

for (let row = 1; row <= size; row++) {
  let line = ''
  for (let column = 1; column <= row; column++) {
    line += (row + column - 1)
  }
  print(line)
}

/*

2
 *
***

3
  *
 ***
*****

*/
