export {}

/*
Home
2. Яблочная философия
Спросить количество яблок в корзине.
Если чётное, порадоваться, что всем досталось поровну.
Если не чётное, объявить поединок за последнее яблоко.
Если яблок не целое количество, сперва нужно извиниться и выкинуть огрызок.
А если ноль, отрицательное количество или бесконечность, отказаться от мелочных материальных забот и по-философствовать о вечном.
*/

const apels = Number(input('Сколько яблок?'))

// не целое число
if (apels !== Math.trunc(apels)) {
  print('Выкень огрызок!')
}

// число делится на 2
if (apels <= 0 || apels == Infinity) {
  print('Чтож давай подумаем о песнях mzlf!!!')
} 
else if (apels % 2 === 0) {
  print('Ура всем поровну!')
}
else {
  print('Битва за яблоко!')
}
