export {}

/*
3. Кибер-Ньютон
Вычислить координату объекта при равноускоренном прямолинейном движении, 
предварительно запросив все необходимые данные с заданной точностью (количество цифр после точки/запятой). 
Формулу можно гуглить
*/

/*
Формула: s=s0+v0t+(at^2)/2, где:

    s0 — начальная координата
    v0 — начальная скорость
    a — ускорение
    t — время
*/

const s0 = Number(input(`Введите начальную координату: `))
const v0 = Number(input(`Введите начальную скорость: `))
const a = Number(input(`Введите ускоренние: `))
const t = Number(input(`Введите времмя: `))

const s = s0 + (v0 * t) + (a * (t**2) / 2)
const result = Math.trunc(s*100)/100

print(`Формула: s=s0+v0t+(at^2)/2`)
print(`s = ${result}`)
