export {}

/*
5. Инвестиции
Спросить сумму денег, которой не жалко рискнуть, и через сколько месяцев мы хотим их вернуть. 
Каждый месяц мы получаем 10% прибыли от изначально вложенной суммы.
Нужно рассчитать, сколько денег мы в итоге заработаем. 
После этого сделай процент случайным (от 1 до 10), о котором тоже нужно сообщить.
*/

const dollars = Number(input("Сколько денег не жалко рескнуть "))
const months = Number(input("Через сколько месецев вы хотите из вернуть "))
const percent = random(1,10)

const result = (dollars / 100 * percent) * months 

print(`Мы вложили ${dollars} под ${percent}% и получили ${result}$ через ${months} месяцев`) 
